Repository: maxsofar/SBapp
Catalog: *.lproj/Localizable.strings
Languages: he

source: Log In (Noun)
he: התחברות

source: Log In (Verb)
he: התחבר

source: Log In (Adverb)
he: להתחברות

source: Sign Up (Noun)
he: הרשמה

source: Sign Up (Verb)
he: הירשם

source: Sign Up (Adverb)
he: להרשמה

source: Not yet registered?
he: עוד לא הצטרפת?

source: Already registered?
he: כבר נרשמת?

source: Email
he: דוא"ל

source: Password
he: סיסמה

source: Favorites
he: מועדפים

source: Enter course name or id
he: הכנס שם או מספר הקורס

source: Week
he: שבוע

source: Filter by Topic
he: סנן לפי נושא

source: All
he: הכל

source: Lecture
he: הרצאה

source: Tutorial
he: תרגול

source: Recording
he: הקלטה

source: Recording %d
he: הקלטה %d

source: Lessons
he: שיעורים

source: Exams
he: מבחנים

source: No Data
he: אין מידע
